In [1]:
import numpy as np 
import pandas as pd

In [2]:
dataset = pd.read_csv('data1.csv') 
dataset

   Region   Age   Income Online Shopper
0   India  49.0  86400.0             No
1  Brazil  32.0  57600.0            Yes
2     USA  35.0  64800.0             No
3  Brazil  43.0  73200.0             No
4     USA  45.0      NaN            Yes
5   India  40.0  69600.0            Yes
6  Brazil   NaN  62400.0             No
7   India  53.0  94800.0            Yes
8     USA  55.0  99600.0             No
9   India  42.0  80400.0            Yes

In [3]:
dataset.dtypes

Region             object
Age               float64
Income            float64
Online Shopper     object
dtype: object

In [ ]:
dataset.describe()

In [ ]:
dataset.columns

In [4]:
dataset['Online Shopper'].value_counts()

Online Shopper
No     5
Yes    5
Name: count, dtype: int64

In [ ]:
dataset['Online Shopper'].value_counts(normalize=True)

In [5]:
dataset['Online Shopper'].unique()

array(['No', 'Yes'], dtype=object)

In [ ]:
dataset["Online Shopper"]

In [6]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
dataset["Online Shopper"] = le.fit_transform(dataset["Online Shopper"])
dataset

   Region   Age   Income  Online Shopper
0   India  49.0  86400.0               0
1  Brazil  32.0  57600.0               1
2     USA  35.0  64800.0               0
3  Brazil  43.0  73200.0               0
4     USA  45.0      NaN               1
5   India  40.0  69600.0               1
6  Brazil   NaN  62400.0               0
7   India  53.0  94800.0               1
8     USA  55.0  99600.0               0
9   India  42.0  80400.0               1

In [7]:
X = dataset.iloc[:, :-1]
Y = dataset.iloc[:, -1]

In [11]:
X

   Region   Age   Income
0   India  49.0  86400.0
1  Brazil  32.0  57600.0
2     USA  35.0  64800.0
3  Brazil  43.0  73200.0
4     USA  45.0      NaN
5   India  40.0  69600.0
6  Brazil   NaN  62400.0
7   India  53.0  94800.0
8     USA  55.0  99600.0
9   India  42.0  80400.0

In [9]:
Y.head()

0    0
1    1
2    0
3    0
4    1
Name: Online Shopper, dtype: int32

In [10]:
X.isnull().sum()

Region    0
Age       1
Income    1
dtype: int64

In [12]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
X["Region"] = le.fit_transform(X["Region"])

In [13]:
X

   Region   Age   Income
0       1  49.0  86400.0
1       0  32.0  57600.0
2       2  35.0  64800.0
3       0  43.0  73200.0
4       2  45.0      NaN
5       1  40.0  69600.0
6       0   NaN  62400.0
7       1  53.0  94800.0
8       2  55.0  99600.0
9       1  42.0  80400.0

#### Fill values

In [14]:
X['Age'].fillna(X['Age'].mean(),inplace=True)

C:\Users\nvgra\AppData\Local\Temp\ipykernel_15804\3485803564.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  X['Age'].fillna(X['Age'].mean(),inplace=True)

In [15]:
X['Age'].mean()

43.77777777777778

In [ ]:
# App 1
X['Age'] = X['Age'].fillna(X['Age'].mean())

In [ ]:
# App 2
X.fillna({'Age': X['Age'].mean()}, inplace=True)

In [ ]:
#X['Income'] = X['Income'].fillna(X['Income'].mean())

In [ ]:
# App 3

In [ ]:
X.fillna({
    'Age': X['Age'].mean(),
    'Income': X['Income'].median()
}, inplace=True)

In [ ]:
X

In [ ]:
Y